[{"name":"Froggy G","description":"Straight out of the marsh pond ghettos of planet Ribbit IV comes the amphibious B.I.G., also known as Nate Frogg, but mostly known as Froggy G. Growing up in the baddest part of town, struggle and incarceration surrounded Froggy from an early age. Taking part in his first swim-by shootout as a tadpole, Froggy seemed destined for a life of crime and prison.\n\nAfter a bloody gangwar with the neighbouring Toad-unit posse ended in a 5 year jail sentence, Froggy G vowed to end his gangsta ways. Instead, Froggy G started earning his keep as a beatboxing streetdancer and rapper, hoping to be picked up by a major record label. Unfortunately, his tracks titled \"Pond Pimpin\", \"Froggin' dirty\" and \"Motherfrogger bounce!\" didn't earn him much.\n\nIn order to make some money, and then make some mo', Froggy G became a hired gun. Combining his shoot-out experiences with lethal watery dance-moves and beatboxing techniques, Froggy G now spins and dashes across intergalactic battlefields, droppin foo's left and right with his fishgun, hoping to make some money to take his momma out of the hood.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/a/a3/Icon_Froggy.png","attacktype":"Short Range","role":"Brawler","wikiurl":"http://awesomenauts.gamepedia.com/wiki/Froggy_G","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/f/fd/FroggyG_Alpha.png","beta":"0","rowNumber":1},{"name":"Sheriff Lonestar","description":"At the heart of the milky way lies the Bovinion system, ruled by a semi intelligent cow-like species. Although technologically advanced to an acceptable level, these Bovinions have maintained a tribal form of society for several thousands of years. Until recent years, an age-old custom in this society was to scare young Bovinian calves with boogeyman stories about a scary cowboy. Naughty Bovinion calves would, as the story went, be caught by this cowboy's unrelenting lasso.\n\nRecently, a wealthy Bovinian visionary opened up a park where visitors would come to see a genetically re-engineered cowboy in action. But disaster struck and the cowboy escaped his cage. Before the Bovinions could react the cowboy had wrangled the entire park staff. Terror shook the Bovinion civilization as the cowboy started to wrangle every single Bovinion on the planet! Suddenly the Bovinions found themselves out of their cities and wrangled into herds on green meadows by the whisky drinking, bucket spitting, yeeehaawing horror.\n\nOnce the entire Bovinian civilization had been wrangled, the cowboy, naming himself Sherriff Lonestar, rode a rocketship into the sunset, his job complete. Now Sherriff Lonestar fights as a mercenary in the robot wars, combining his awesome cowboy-powers with high tech weaponry to earn some solar to spend on whisky and cigars.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/f/f1/Icon_Lonestar.png","attacktype":"Medium Range","role":"Pusher","wikiurl":"http://awesomenauts.gamepedia.com/wiki/Sheriff_Lonestar","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/b/b4/SheriffLonestar_Alpha.png","beta":"0","rowNumber":2},{"name":"Leon Chameleon","description":"Leon's life is a life of crime, women, and borrowing without returning. He lost his arm in a unfortunate jeu de boules incident and spends most of his time smoothly escaping debt collectors. He found himself breaking into the bedroom of the prime minister's wife, while looking for the wine cellar.\n\nHe knew no amount of charm could save him this time and planned his escape, which was eventually delayed because he refused to escape in anything but a space yacht.\n\nLeon joined the Awesomenauts for some quick cash, spending it on beautiful women and exquisite meals. In combat, he puts his natural reptile abilities to some good use and slices up his enemies with great precision. Combat is a form of art for this green gentleman.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/d/d5/Icon_Leon.png","attacktype":"Melee","role":"Assassin","wikiurl":"http://awesomenauts.gamepedia.com/Leon_Chameleon","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/7/7b/Leon_Alpha.png","beta":"0","rowNumber":3},{"name":"Clunk","description":"Clunk is a robot suffering from anger management issues. He's saving up money to pay for therapy, but keeps losing it due to damage compensations. Originally created as part of a robot army built to combat an immensely powerful super villain terrorizing the outer star systems, Clunk found himself without a job when the villain accidentally died of a nasty bacterial infection before the robot army was completed.\n\nThis was actually a blessing in disguise for Clunk, since he was never designed to return in one piece from his mission. He was refitted to do standard housekeeping work, but soon found himself out of work once more as he kept blowing aggression inhibitors and subsequently went into immensely destructive \ntantrums.\n\nEventually, Clunk signed up as a mercenary to do what he is best at: wrecking things. He found that finally giving in to his aggressive nature has given him great inner peace. Nowadays he takes great pleasure in jetting around the battlefield, blowing up in peoples' faces to the sound of heavy metal.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/2/25/Icon_Clunk.png","attacktype":"Medium Range","role":"Tank","wikiurl":"http://awesomenauts.gamepedia.com/Clunk","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/5/59/Clunk_Alpha.png","beta":"0","rowNumber":4},{"name":"Voltar the Omniscient","description":"Voltar's past is shrouded in mystery. Rumor has it he once was a researcher at a star-encapsulating power station. The station made intergalactic headlines when it exploded around 500 years ago, sending off ail kinds of strange, unseen radiation into space. In this explosion, the Al core of the Zero's was destroyed, bringing an abrupt end to the First Al War. Although peace was maintained for some centuries, the war eventually returned. Some think that war was just too profitable, and suspect that weapon manufacturers had a hand in the construction of a new Al core for the Zero's.\nThe explosion at the power station destroyed almost every part of Voltar's body, leaving only his brilliant brain intact. This brain was carefully placed inside a Braintank by salvagers. Through the years, and with help of his loyal robot drones, he made some nifty modifications to his braintank that enabled him to participate in the newly erupted Robot Wars.\n\nNo-one knows Voltar's true motives for participating in the war as a mercenary, but what can be assured is that he’s a mastermind with unmatched psychotechnic powers and an arsenal of armed robots that do his every bidding.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/d/d5/Icon_Voltar.png","attacktype":"Short Range","role":"Healer","wikiurl":"http://awesomenauts.gamepedia.com/Voltar_the_Omniscient","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/3/31/Voltar_Alpha.png","beta":"0","rowNumber":5},{"name":"Gnaw","description":"Skroggle infestations have been reported on over a dozen planets. The highly adaptable Skroggle physiology allows them to thrive in almost any atmosphere. Skroggles are omnivorous and their bizarre metabolism enables them to vomit plant-like creatures that excrete volatile acidic spores.\nGnaw was taken from his home-planet as a Skroggle specimen by Kremzonian scientists. But Gnaw was not a beast that could be caged: his acid-breath melted his holding pen and Gnaw started to rampage through the science facility where he was held. No-one knows exactly what happened, but the facility was found 12 days later, abandoned, and overgrown with some weird, toxic flora.\n\nGnaw was eventually noticed by a passing band of Amphibian cosmic bikerpirates. Gnaw was in need of some friends, and he was taken in by them, nurtured and trained to fight in black-market exotic-alien arena fights. Occasionally his masters sell Gnaw's \"services\" to any war general that is desperate enough to set loose the rapid, chitinous menace upon the battlefield.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/9/92/Icon_Gnaw.png","attacktype":"Melee","role":"Defensive","wikiurl":"http://awesomenauts.gamepedia.com/Gnaw","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/6/6d/CharacterRender_Gnaw.png","beta":"0","rowNumber":6},{"name":"Coco Nebulon","description":"Hailing from a psyonic race near the outer brim of the galaxy, comes Coco Nebulon, the cosmic waveblazer. Coco rides her combat waveboard into battle, using her psyonic powers to subdue her adversaries. Why Coco fights in the war is a bit unclear, as no-one can really understand her when she talks. \n\nExcerpt from her spacelog: \"It's just like, dude, I was cruisin' the galaxy, you know, in this totally tubular space-van, searching for the best cosmic waves man. And, you know, like, when I was, like, you know, like acing these waves once, there was like this giant robot corporation that wanted to make like these waves like into a giant galactic like battlefield you know? And I was all like, oh man, that's so un-narly dude. But those robots were all like 10100111001 or whatever. So I was all like, yeah but ok, you know? And then these robots were all like, ohh we have to fight eachother. And they were like shooting lasers at eachother man. And I was like, man, I gotta fight, you know, like totally with these robots against the other robots because it's like, you know, whatever.\"","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/2/22/Icon_Coco.png","attacktype":"Melee","role":"Harasser","wikiurl":"http://awesomenauts.gamepedia.com/Coco_Nebulon","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/2/28/CocoNebulon_Alpha.png","beta":"0","rowNumber":7},{"name":"Skølldir","description":"Skølldir the Terrible Space Viking has raided over a hundred spaceports, cargo ships and grocery stores. His legendary thirst for battle is unquenchable. Great raids are usually followed by great feasts and soon his nickname was altered to Skolldir The Terribly Overweight Space Viking. Nothing could scorn Skølldir more than this honorless title!\n\nSkølldir has set out on his space barge to impress the universe with his lightning fast fighting skills to prove this moniker wrong and show his nimbleness. Anyone who would dare to call him fat is met with a rapid series of crushing punches and is thrown aside. All the while, Skølldir's metallic suit is telling him how many calories he is burning.\n\nIf you find yourself on the battlefield, and hear the sound of crushing bones and thunderous farts in the distance, flee as Skølldirs fury is upon you! ","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/9/94/Menu_IconCharacterBrute.PNG","attacktype":"Melee","role":"Brawler","wikiurl":"http://awesomenauts.gamepedia.com/Sk%C3%B8lldir","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/a/a6/Skolldir_Alpha.png","beta":"0","rowNumber":8},{"name":"Yuri","description":"Once part of the soviet space program, Yuri was a monkey, experimentally shot into space during the 1960s cold war spacerace. Mysteriously, monitoring soviet scientists suddenly lost track of monkey Yuri's spacecraft.\n\nPuzzled by its sudden disappearance, Soviet space-command wondered what had become of their beloved test-pet Yuri. Little did they know that Yuri's spacecraft had entered a warpfield anomaly and was transported hundreds of years into the future!\n\nAlso, the warpfields radiation boosted Yuri's mind to superintelligent levels. The new, more intelligent, mad and slightly sadistic Yuri quickly grasped the situation and modified his broken rocket into an equally mad timetraveling supercomputer jetpack.\n\nWith the jetpack translating everything Yuri says and does, enemies are never quite sure who is in control, the mad scientist monkey, or the computer it \ncreated?","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/e/e4/Icon_Yuri.png","attacktype":"Long Range","role":"Support","wikiurl":"http://awesomenauts.gamepedia.com/Yuri","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/0/05/Yuri_Alpha.png","beta":"0","rowNumber":9},{"name":"Raelynn","description":"Raelynn loves big guns. After highschool she went straight into the E.L.F. army to fight against the invading robots, just before the first AI war. \n\nShe was trained by the best and excelled in long range weaponary. Within a year she was given the honor of joining an elite squad called the SkyHawks, where she met the love of her life: her Pulserifle \"Cuddles\".\n\nFor years they did covert missions together as a team to disrupt robot production and steal robot technologies. They were feared by all robots (well...the ones with emo-chips). \n\nUntil that one deep space mission to AI station 404 in the year 3009, where she ran into a robot ambush, and \"Cuddles\" was brutally taken away from her. Raelynn was put into cryo statis. Decades passed until a small mercenary team found her hidden on the planet. There she was rejoined with \"Cuddles\" and many warm 'hugs' were given that day to all robots on 404.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/b/bd/Menu_IconCharacterHunter.png","attacktype":"Long Range","role":"Sniper","wikiurl":"http://awesomenauts.gamepedia.com/Raelynn","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/6/61/CharacterRender_Hunter.png","beta":"0","rowNumber":10},{"name":"Derpl Zork","description":"Riding his combat walker onto the battlefield, comes Derpl Zork. The nephew of Blabl Zork, president of Zork industries. Derpl Zork lacks his uncle's business-smarts. In fact he lacks any kind of smarts, managing to get his IQ rated under the level of plankton in the official galaxial IQ test.\nNevertheless Derpl is the heir apparent to Blabl's galaxy-spanning business empire. This is something that doesn't sit well with Blabl, not well at all. Dreading the day Derpl would inherit the company and run all the hardfought accomplishments into the ground, Blabl put Derpl in charge of fieldtesting the new Specialized Universal Secretary Interface (S.U.S.I. for short) in one of Zork Industries' combat walkers. Asking Derpl what form of devastation should be issued forth from his vehicle of destruction he simply drooled and said: \"I wuv cats!\"\n\nNow Blabl is anxiously awaiting the day that Derpl would suffer a fatal blow on the fields of battle but as of yet Derpl's combat walker has proven to keep making up for its dimwitted driver.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/4/4d/Icon_Derpl.png","attacktype":"Medium Range","role":"Tank","wikiurl":"http://awesomenauts.gamepedia.com/Derpl_Zork","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/c/ce/DerplZork_Alpha.png","beta":"0","rowNumber":11},{"name":"Vinnie & Spike","description":"Vinnie and Spike are notorious partners in crime and BFF's. Spike is the muscle of the team and a bit of a silent guy, he loves late night krab burgers. \n\nVinnie is quite the hothead, leaving Spike to do the heavy lifting while he plots out the next heist. With a pack full of restraining orders this little plankton devil is not to be messed with. They are wanted on numerous planets including their homeplanet Okeanos where the largest crime syndicate Shisu has put a reward on their head for stealing the Kullinan Koi, the biggest golden Koi ever known to fish and worth 4.8 Billion Solar. \n\nUnfortunately the duo lost the Koi somewhere in the Atlantic ocean while fleeing from Interpool.\n\nBeing a pufferfish, Spike can gasp for air and float up, flapping his fins to move around. He is always ready for a fast getaway and can dash out of combat, leaving a smokebomb behind to fool his enemies, while both Vinnie and Spike run with the loot.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/9/9d/Menu_IconCharacterBird.png","attacktype":"Medium Range","role":"Assassin","wikiurl":"http://awesomenauts.gamepedia.com/Vinnie_%26_Spike","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/a/a1/CharacterRender_Birdman_redBG.png","beta":"0","rowNumber":12},{"name":"Genji the Pollen Prophet","description":"Genji is one of the last of his species: an Entin. The Entin are rapidly reproducing caterpillars with a high libido and no sense of limitation. Any planet the Entin visit, they leave ravaged in their wake. They have been labeled a pest in need of extermination for eating entire continents worth of crops and terrorizing the local populace with late night techno raves. As a result, their kind has been bugsprayed to the brink of extinction.\n\nTrying to better their ways, the remaining Entin have created the Order of Popae Monks on the fungi moon Pulvan. Fasting heavily they devote everything to their beloved deity: The Grand Space Butterfly!\n\nGenji sinned with snacks and dirty literature however, and after repeated solitary cocoonfinements failed to make him better his ways, he was sent out on an emergency soul-cleansing pilgrimage through the galaxy.\n\nJoining the Awesomenauts to cut back on the traveling costs of his journey, Genji has been the scourge of many a ship's pantry and is rumored to be the main reason some of the smaller more edible-looking 'naut recruits have gone missing.","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/7/71/Menu_IconCharacterButterfly.png","attacktype":"Medium Range","role":"Brawler","wikiurl":"http://awesomenauts.gamepedia.com/Genji_the_Pollen_Prophet","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/3/32/CharacterRender_genji.png","beta":"0","rowNumber":13},{"name":"Ayla","description":"Ayla is a devious little girl. She comes from an old species called the Sadak, known for their great psychokinetic powers. Her parents were killed during the great Sevenelevian Coupon Wars and she was adopted by a sweet alien family. The couple grew fearful, however, when suspicious things started happening around the house: evil drawings on the wall, weird sounds at night and dead rapper frogs in the garden.\n\nWhen they finally figured out Ayla's \"gifts\" and dark sense of humor, they turned her over to the Sunny-daisy School of Social Re-adjustment. A few short days and several fires later, she got transferred to a maximum security psychiatric ward where she went berserk and chose the nearest wall for her stage exit. \n\nUsing her cute puppy-dog eye routine she managed to hitchhike her way across the galaxy and ended up with the Awesomenauts who, after her tantrums left half the ship in ruins, couldn't wait to get her in a droppod and away from their precious belongings. Still, she's a cherished member of the group, requiring only a gold-star sticker for her efforts on the field of battle!","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/b/bf/Menu_IconCharacterVampire.png","attacktype":"Melee","role":"Brawler","wikiurl":"http://awesomenauts.gamepedia.com/Ayla","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/2/21/CharacterRender_Vampire.png","beta":"0","rowNumber":14},{"name":"Admiral Swiggins","description":"Raised in the Swiggins Navy Family on the Kraken planet Titan. Charles Swiggins was the youngest of 30 siblings. Graduating from Wet Point with top honors, he quickly rose through the ranks to become Captain of his very first ship in the Royal Fleet. This ship was called the ‘Sweet \nHomboldt’.\n\nTasked with finding and defeating Pirates, Swiggins set out with a loyal crew on many succesfull sortees. One day, the Homboldt chanced upon the massive Pirateship 'Colossus' helmed by the dreaded Captain Inkbeard! After a furious battle, which reduced both ships to floating heaps of debris, the two captains were the only ones alive for a final showdown. Being nearly overpowered, Swiggins' grasping tentacle found a chain just below the surface of the churning water. Powered by his desperation he hurled the object at his foe. This object was Sweet Homboldts anchor! With one massive blow, Swiggins ended the biggest Pirate threat on Titan once and for all.\n\nNow an Admiral, he has exchanged the seas for the voids of space where his fame and leadership skills have found him a contract among the Awesomenauts!\n","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/6/62/Menu_IconCharacterCaptain.png","attacktype":"Melee","role":"Initiator","wikiurl":"http://awesomenauts.gamepedia.com/Admiral_Swiggins","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/0/0c/CharacterRender_swiggins_redBG.png?version=d508b16a3ff4f9866e2548a67ec83ee7","beta":"0","rowNumber":15},{"name":"Ted McPain","description":"Ted McPain was one of the great heroes of the first AI Wars, a long time ago. He has led his squad of elite super soldiers, the Killer Koala’s, against many opponents and has been decorated as an outstanding soldier a hundred times over. His ultimate achievement, during the climax of the First AI Wars, was a solo operation onto the AI’s battle station Starstorm. This mission ended in Ted McPain single handedly unhinging all of the station’s crucial power couplings, effectively making sure the station wouldn’t be completed before the end of the war.Ted McPain eventually died when he sacrificed himself to save the Sunny-Daisy Alien Orphanage from a band of bloodthirsty dinosaur zombies in 3021. Ted’s heroic deeds would never be forgotten.He lived on as he became the star of various video games: Ted McPain I through XVII, Ted McPain: Zombie Blast, Ted McPain vs. evil Ted\n McPain and Ted McPain Unicorn Dance Karting. When Voltar The Omniscient learned of the violent dimwitted video game star, he brewed up a plan that would backfire horribly. He created the Materializotron XT8000 with which he wanted to bring back the war hero of old to be his personal assistant. Extracting Ted McPain’s digital essence from his video games, Voltar managed to materialize a life-size flesh and blood version. The Ted McPain that appeared though was missing his pants for unknown reasons. Voltar waved the issue aside saying “Stop asking stupid questions! He looks fine to me.”\n","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/2/24/Menu_IconCharacterCommando.png","attacktype":"Short and Medium Range","role":"Brawler","wikiurl":"http://awesomenauts.gamepedia.com/Ted_McPain","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/c/c7/Tedmcpain.png","beta":"0","rowNumber":16},{"name":"Penny Fox","description":"As an honorary Star Scout, Penny's lifestyle was one of exploration and adventure. During her years out scout-badge-hunting among the tars on her trusty space-scooter, she saw many wonderous places and lifeforms.\n\nOne of the many hobbies that developed during these years, is the collecting and stuffing in jars of those same wonderous lifeforms and various other doodads. Cataloguing and archiving everything in neatly labeled containers for her own private collection is something Penny takes great pride in.\n\nWhile adding the latest uncooperative alien lifeform to her jar collection, she contemplated the meaning of life, the universe and everything. Looking back on all those innocently staring eyes from the rows upon rows of jars, Penny realised that there was so much more a sole Star Scout could do with  butterfly net! She swore a vow on scout's honor to stuff the galaxy's evil doers into her jars, making the universe a better place for the cute and the cuddly!\n\nWithout a second thought she jumped on her scooter and set off toward the stars. It was well beyond the point of no return when she realised that her trusty yet rather dated mode of transportation might not be up to the task of traversing the universe without the not-so-annual tune-up she forgot for the fifth year in a row. As the scooter shuddered to an embarrassing stop somewhere in the Raki system, she kept her calm and assessed the situation. A brief scan for spare parts showed a strange uncharted derilict station in the vicinity which seemed to have everything she needed to fix her broken mode of transport. Awkwardly making her way toward it using the Star Scout approved Deep-Space Breast Stroke, she found the name \"Starstorm\" emblazened on the hull of this grimy time-worn, and seemingly abandoned spacestation.\n\nDuring her searches inside the bowels of the station, she found a mysterious robotic claw artifact. Curiosity being known to killing the inferior feline species, this confident canine locked it immediately to her wrist and was suddenly awash with power.\n\nUnbeknownst to Penny, she had just taken the first step toward the biggest adventure of her life!\n","icon":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/5/5a/Menu_IconCharacterAssassin.png","attacktype":"Melee and Range","role":"Assassin, Harasser, Pusher, Mobility, Swift","wikiurl":"http://awesomenauts.gamepedia.com/Penny_Fox","image":"http://hydra-media.cursecdn.com/awesomenauts.gamepedia.com/6/61/UI_PortraitCharacter_Assassin.png","beta":"0","rowNumber":17}]